gingerologist/stm32-project-bundle/mx/tong-v2-g431k6u6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define EN_NEG_HV_Pin GPIO_PIN_3
#define EN_NEG_HV_GPIO_Port GPIOA
#define SPI_NSS_Pin GPIO_PIN_4
#define SPI_NSS_GPIO_Port GPIOA
#define EN_POS_HV_Pin GPIO_PIN_0
#define EN_POS_HV_GPIO_Port GPIOB
#define MUX_SEL2_Pin GPIO_PIN_11
#define MUX_SEL2_GPIO_Port GPIOA
#define MUX_SEL3_Pin GPIO_PIN_12
#define MUX_SEL3_GPIO_Port GPIOA
#define CH0_SD_Pin GPIO_PIN_15
#define CH0_SD_GPIO_Port GPIOA
#define CH1_SD_Pin GPIO_PIN_3
#define CH1_SD_GPIO_Port GPIOB
#define MUX_EN_Pin GPIO_PIN_4
#define MUX_EN_GPIO_Port GPIOB
#define MUX_SEL4_Pin GPIO_PIN_5
#define MUX_SEL4_GPIO_Port GPIOB
#define MUX_SEL1_Pin GPIO_PIN_6
#define MUX_SEL1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
